zephyrproject-rtos/zephyr/soc/nxp/mcx/mcxa/power.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/pm/pm.h>
#include <zephyr/arch/arch_interface.h>
#include <zephyr/device.h>
#include <fsl_cmc.h>
#include <fsl_spc.h>
#include <fsl_wuu.h>

#define WUU_WAKEUP_LPTMR0_IDX	6U
#define MCXA_WAKEUP_DELAY	DT_PROP_OR(DT_NODELABEL(spc), wakeup_delay, 0)
#define MCXA_WUU_ADDR		(WUU_Type *)DT_REG_ADDR(DT_INST(0, nxp_wuu))
#define MCXA_CMC_ADDR		(CMC_Type *)DT_REG_ADDR(DT_INST(0, nxp_cmc))
#define MCXA_SPC_ADDR		(SPC_Type *)DT_REG_ADDR(DT_INST(0, nxp_spc))

static void pm_enter_hook(void)
{
	CMC_SetPowerModeProtection(MCXA_CMC_ADDR, kCMC_AllowAllLowPowerModes);
	CMC_EnableDebugOperation(MCXA_CMC_ADDR, false);
	CMC_ConfigFlashMode(MCXA_CMC_ADDR, true, true, false);
	WUU_SetInternalWakeUpModulesConfig(MCXA_WUU_ADDR, WUU_WAKEUP_LPTMR0_IDX,
					   kWUU_InternalModuleInterrupt);
}

static void enter_low_power(void)
{
	unsigned int key;

	key = arch_pm_state_set_prepare();
	__DSB();
	__ISB();
	__WFI();
	arch_pm_state_set_finish(key);
}

__weak void pm_state_set(enum pm_state state, uint8_t substate_id)
{
	pm_enter_hook();

	SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

	switch (state) {
	case PM_STATE_RUNTIME_IDLE:
		CMC_SetClockMode(MCXA_CMC_ADDR, kCMC_GateCoreClock);
		CMC_SetMAINPowerMode(MCXA_CMC_ADDR, kCMC_ActiveOrSleepMode);
		enter_low_power();
		break;

	case PM_STATE_SUSPEND_TO_IDLE:
		CMC_SetClockMode(MCXA_CMC_ADDR, kCMC_GateAllSystemClocksEnterLowPowerMode);
		CMC_SetMAINPowerMode(MCXA_CMC_ADDR, kCMC_DeepSleepMode);
		enter_low_power();
		break;

	case PM_STATE_STANDBY:
		SPC_SetLowPowerWakeUpDelay(SPC0, MCXA_WAKEUP_DELAY);
		CMC_SetClockMode(MCXA_CMC_ADDR, kCMC_GateAllSystemClocksEnterLowPowerMode);
		CMC_SetMAINPowerMode(MCXA_CMC_ADDR, kCMC_PowerDownMode);
		enter_low_power();
		break;

	default:
		break;
	}
}

__weak void pm_state_exit_post_ops(enum pm_state state, uint8_t substate_id)
{
	ARG_UNUSED(state);
	ARG_UNUSED(substate_id);

	if ((SCB->SCR & SCB_SCR_SLEEPDEEP_Msk) == SCB_SCR_SLEEPDEEP_Msk) {
		SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
	}

	SPC_ClearPowerDomainLowPowerRequestFlag(MCXA_SPC_ADDR, kSPC_PowerDomain0);
	SPC_ClearLowPowerRequest(MCXA_SPC_ADDR);
}
